Transformer(
  (token_embedding_table): Embedding(256, 64)
  (ln): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
  (lm_head): Linear(in_features=64, out_features=256, bias=True)
  (blocks): Sequential(
    (0): TransformerBlock(
      (sa_heads): WindowAttention(
        (kqv): Linear(in_features=64, out_features=192, bias=False)
        (out_head): Linear(in_features=64, out_features=64, bias=True)
        (dropout): Dropout(p=0.4, inplace=False)
      )
      (ln1): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
      (ffw): FeedForward(
        (net): Sequential(
          (0): Linear(in_features=64, out_features=256, bias=True)
          (1): ReLU()
          (2): Linear(in_features=256, out_features=64, bias=True)
          (3): Dropout(p=0.4, inplace=False)
        )
      )
      (ln2): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
    )
    (1): TransformerBlock(
      (sa_heads): WindowAttention(
        (kqv): Linear(in_features=64, out_features=192, bias=False)
        (out_head): Linear(in_features=64, out_features=64, bias=True)
        (dropout): Dropout(p=0.4, inplace=False)
      )
      (ln1): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
      (ffw): FeedForward(
        (net): Sequential(
          (0): Linear(in_features=64, out_features=256, bias=True)
          (1): ReLU()
          (2): Linear(in_features=256, out_features=64, bias=True)
          (3): Dropout(p=0.4, inplace=False)
        )
      )
      (ln2): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
    )
    (2): TransformerBlock(
      (sa_heads): WindowAttention(
        (kqv): Linear(in_features=64, out_features=192, bias=False)
        (out_head): Linear(in_features=64, out_features=64, bias=True)
        (dropout): Dropout(p=0.4, inplace=False)
      )
      (ln1): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
      (ffw): FeedForward(
        (net): Sequential(
          (0): Linear(in_features=64, out_features=256, bias=True)
          (1): ReLU()
          (2): Linear(in_features=256, out_features=64, bias=True)
          (3): Dropout(p=0.4, inplace=False)
        )
      )
      (ln2): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
    )
    (3): TransformerBlock(
      (sa_heads): WindowAttention(
        (kqv): Linear(in_features=64, out_features=192, bias=False)
        (out_head): Linear(in_features=64, out_features=64, bias=True)
        (dropout): Dropout(p=0.4, inplace=False)
      )
      (ln1): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
      (ffw): FeedForward(
        (net): Sequential(
          (0): Linear(in_features=64, out_features=256, bias=True)
          (1): ReLU()
          (2): Linear(in_features=256, out_features=64, bias=True)
          (3): Dropout(p=0.4, inplace=False)
        )
      )
      (ln2): LayerNorm((64,), eps=1e-05, elementwise_affine=True)
    )
  )
)
236224 parámetros